Shoaibashk/MS51_BSP/hal/include/ms51_sfr_32k.h
/*===========================================================================
 * @file    ms51_sfr_32k.h
 * @brief   MS51 32KB Variant SFR Definitions
 * @version 2.0.0
 * @date    2025-11-30
 * 
 * @details Special Function Register definitions for MS51 32KB variants:
 *          - MS51FC0AE
 *          - MS51XC0BE
 *          - MS51EB0AE
 *          - MS51EC0AE
 *          - MS51TC0AE
 *          - MS51PC0AE
 * 
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (c) 2025 Nuvoton Technology Corp. All rights reserved.
 *===========================================================================*/

#ifndef MS51_SFR_32K_H
#define MS51_SFR_32K_H

#include "ms51_compiler.h"

#ifdef __cplusplus
extern "C" {
#endif

/*===========================================================================
 * Device Information
 *===========================================================================*/
#define MS51_FLASH_SIZE         32768   /* 32KB APROM */
#define MS51_LDROM_SIZE         4096    /* 4KB LDROM */
#define MS51_IRAM_SIZE          256     /* 256 bytes IRAM */
#define MS51_XRAM_SIZE          2048    /* 2KB XRAM */
#define MS51_DATAFLASH_SIZE     4096    /* 4KB Data Flash */
#define MS51_PAGE_SIZE          128     /* Flash page size */

/*===========================================================================
 * SFR Definitions - Compiler Specific
 *===========================================================================*/

#if defined(COMPILER_KEIL)

/*---------------------------------------------------------------------------
 * Keil C51 SFR Definitions - Page 0
 *---------------------------------------------------------------------------*/

/* Port 0 (0x80) */
sfr P0          = 0x80;
sbit P07        = P0^7;
sbit RXD        = P0^7;
sbit P06        = P0^6;
sbit TXD        = P0^6;
sbit P05        = P0^5;
sbit P04        = P0^4;
sbit STADC      = P0^4;
sbit P03        = P0^3;
sbit P02        = P0^2;
sbit RXD_1      = P0^2;
sbit P01        = P0^1;
sbit MISO       = P0^1;
sbit P00        = P0^0;
sbit MOSI       = P0^0;

/* Stack Pointer, Data Pointer (0x81-0x83) */
sfr SP          = 0x81;
sfr DPL         = 0x82;
sfr DPH         = 0x83;

/* RC Oscillator Trim (0x84-0x85) */
sfr RCTRIM0     = 0x84;
sfr RCTRIM1     = 0x85;

/* RWK, PCON (0x86-0x87) */
sfr RWKL        = 0x86;
sfr PCON        = 0x87;

/* Timer Control (0x88-0x8F) */
sfr TCON        = 0x88;
sbit TF1        = TCON^7;
sbit TR1        = TCON^6;
sbit TF0        = TCON^5;
sbit TR0        = TCON^4;
sbit IE1        = TCON^3;
sbit IT1        = TCON^2;
sbit IE0        = TCON^1;
sbit IT0        = TCON^0;

sfr TMOD        = 0x89;
sfr TL0         = 0x8A;
sfr TL1         = 0x8B;
sfr TH0         = 0x8C;
sfr TH1         = 0x8D;
sfr CKCON       = 0x8E;
sfr WKCON       = 0x8F;

/* Port 1 (0x90) */
sfr P1          = 0x90;
sbit P17        = P1^7;
sbit P16        = P1^6;
sbit TXD_1      = P1^6;
sbit P15        = P1^5;
sbit P14        = P1^4;
sbit SDA        = P1^4;
sbit P13        = P1^3;
sbit SCL        = P1^3;
sbit P12        = P1^2;
sbit P11        = P1^1;
sbit P10        = P1^0;

/* System Control (0x91-0x97) */
sfr SFRS        = 0x91;     /* TA Protected */
sfr CAPCON0     = 0x92;
sfr CAPCON1     = 0x93;
sfr CAPCON2     = 0x94;
sfr CKDIV       = 0x95;
sfr CKSWT       = 0x96;     /* TA Protected */
sfr CKEN        = 0x97;     /* TA Protected */

/* UART0 (0x98-0x99) */
sfr SCON        = 0x98;
sbit SM0        = SCON^7;
sbit FE         = SCON^7;
sbit SM1        = SCON^6;
sbit SM2        = SCON^5;
sbit REN        = SCON^4;
sbit TB8        = SCON^3;
sbit RB8        = SCON^2;
sbit TI         = SCON^1;
sbit RI         = SCON^0;

sfr SBUF        = 0x99;
sfr SBUF_1      = 0x9A;
sfr EIE         = 0x9B;
sfr EIE1        = 0x9C;
sfr CHPCON      = 0x9F;     /* TA Protected */

/* Port 2 (0xA0) */
sfr P2          = 0xA0;
sbit P27        = P2^7;
sbit P26        = P2^6;
sbit P25        = P2^5;
sbit P24        = P2^4;
sbit P23        = P2^3;
sbit P22        = P2^2;
sbit P21        = P2^1;
sbit P20        = P2^0;

/* Auxiliary, BOD, IAP (0xA2-0xAF) */
sfr AUXR1       = 0xA2;
sfr BODCON0     = 0xA3;     /* TA Protected */
sfr IAPTRG      = 0xA4;     /* TA Protected */
sfr IAPUEN      = 0xA5;     /* TA Protected */
sfr IAPAL       = 0xA6;
sfr IAPAH       = 0xA7;

/* Interrupt Enable (0xA8) */
sfr IE          = 0xA8;
sbit EA         = IE^7;
sbit EADC       = IE^6;
sbit EBOD       = IE^5;
sbit ES         = IE^4;
sbit ET1        = IE^3;
sbit EX1        = IE^2;
sbit ET0        = IE^1;
sbit EX0        = IE^0;

sfr SADDR       = 0xA9;
sfr WDCON       = 0xAA;     /* TA Protected */
sfr BODCON1     = 0xAB;     /* TA Protected */
sfr P3M1        = 0xAC;
sfr P3M2        = 0xAD;
sfr IAPFD       = 0xAE;
sfr IAPCN       = 0xAF;

/* Port 3 (0xB0) */
sfr P3          = 0xB0;
sbit P37        = P3^7;
sbit P36        = P3^6;
sbit P35        = P3^5;
sbit P34        = P3^4;
sbit P33        = P3^3;
sbit P32        = P3^2;
sbit P31        = P3^1;
sbit P30        = P3^0;

/* Port Mode Registers (0xB1-0xB7) */
sfr P0M1        = 0xB1;
sfr P0M2        = 0xB2;
sfr P1M1        = 0xB3;
sfr P1M2        = 0xB4;
sfr TOE         = 0xB5;
sfr IPH         = 0xB7;

/* Interrupt Priority (0xB8) */
sfr IP          = 0xB8;
sbit PADC       = IP^6;
sbit PBOD       = IP^5;
sbit PS         = IP^4;
sbit PT1        = IP^3;
sbit PX1        = IP^2;
sbit PT0        = IP^1;
sbit PX0        = IP^0;

sfr SADEN       = 0xB9;
sfr SADEN_1     = 0xBA;
sfr SADDR_1     = 0xBB;
sfr I2DAT       = 0xBC;
sfr I2STAT      = 0xBD;
sfr I2CLK       = 0xBE;
sfr I2TOC       = 0xBF;

/* I2C Control (0xC0) */
sfr I2CON       = 0xC0;
sbit I2CEN      = I2CON^6;
sbit STA        = I2CON^5;
sbit STO        = I2CON^4;
sbit SI         = I2CON^3;
sbit AA         = I2CON^2;
sbit I2CPX      = I2CON^0;

sfr I2ADDR      = 0xC1;
sfr ADCRL       = 0xC2;
sfr ADCRH       = 0xC3;
sfr T3CON       = 0xC4;
sfr RL3         = 0xC5;
sfr RH3         = 0xC6;
sfr TA          = 0xC7;

/* Timer 2 Control (0xC8) */
sfr T2CON       = 0xC8;
sbit TF2        = T2CON^7;
sbit TR2        = T2CON^2;
sbit CM_RL2     = T2CON^0;

