Shoaibashk/MS51_BSP/hal/include/ms51_sfr_32k.h
sfr T2MOD       = 0xC9;
sfr RCMP2L      = 0xCA;
sfr RCMP2H      = 0xCB;
sfr TL2         = 0xCC;
sfr TH2         = 0xCD;
sfr ADCMPL      = 0xCE;
sfr ADCMPH      = 0xCF;

/* Program Status Word (0xD0) */
sfr PSW         = 0xD0;
sbit CY         = PSW^7;
sbit AC         = PSW^6;
sbit F0         = PSW^5;
sbit RS1        = PSW^4;
sbit RS0        = PSW^3;
sbit OV         = PSW^2;
sbit P          = PSW^0;

/* PWM0 Period and Duty (0xD1-0xD7) */
sfr PWM0PH      = 0xD1;
sfr PWM0C0H     = 0xD2;
sfr PWM0C1H     = 0xD3;
sfr PWM0C2H     = 0xD4;
sfr PWM0C3H     = 0xD5;
sfr PNP         = 0xD6;
sfr PWM0FBD     = 0xD7;

/* PWM0 Control (0xD8) */
sfr PWM0CON0    = 0xD8;
sbit PWMRUN     = PWM0CON0^7;
sbit LOAD       = PWM0CON0^6;
sbit PWMF       = PWM0CON0^5;
sbit CLRPWM     = PWM0CON0^4;

sfr PWM0PL      = 0xD9;
sfr PWM0C0L     = 0xDA;
sfr PWM0C1L     = 0xDB;
sfr PWM0C2L     = 0xDC;
sfr PWM0C3L     = 0xDD;
sfr PIOCON0     = 0xDE;
sfr PWM0CON1    = 0xDF;

/* Accumulator (0xE0) */
sfr ACC         = 0xE0;

/* ADC Control (0xE1-0xE7) */
sfr ADCCON1     = 0xE1;
sfr ADCCON2     = 0xE2;
sfr ADCDLY      = 0xE3;
sfr C0L         = 0xE4;
sfr C0H         = 0xE5;
sfr C1L         = 0xE6;
sfr C1H         = 0xE7;

/* ADC Control 0 (0xE8) */
sfr ADCCON0     = 0xE8;
sbit ADCF       = ADCCON0^7;
sbit ADCS       = ADCCON0^6;
sbit ETGSEL1    = ADCCON0^5;
sbit ETGSEL0    = ADCCON0^4;
sbit ADCHS3     = ADCCON0^3;
sbit ADCHS2     = ADCCON0^2;
sbit ADCHS1     = ADCCON0^1;
sbit ADCHS0     = ADCCON0^0;

/* Pin Interrupt (0xE9-0xEF) */
sfr PICON       = 0xE9;
sfr PINEN       = 0xEA;
sfr PIPEN       = 0xEB;
sfr PIF         = 0xEC;
sfr C2L         = 0xED;
sfr C2H         = 0xEE;
sfr EIP         = 0xEF;

/* B Register (0xF0) */
sfr B           = 0xF0;

/* Capture, SPI (0xF1-0xF7) */
sfr CAPCON3     = 0xF1;
sfr CAPCON4     = 0xF2;
sfr SPCR        = 0xF3;
sfr SPSR        = 0xF4;
sfr SPDR        = 0xF5;
sfr AINDIDS0    = 0xF6;
sfr EIPH        = 0xF7;

/* UART1 Control (0xF8) */
sfr SCON_1      = 0xF8;
sbit SM0_1      = SCON_1^7;
sbit FE_1       = SCON_1^7;
sbit SM1_1      = SCON_1^6;
sbit SM2_1      = SCON_1^5;
sbit REN_1      = SCON_1^4;
sbit TB8_1      = SCON_1^3;
sbit RB8_1      = SCON_1^2;
sbit TI_1       = SCON_1^1;
sbit RI_1       = SCON_1^0;

/* PWM0 Dead Time, Power Management (0xF9-0xFF) */
sfr PWM0DTEN    = 0xF9;     /* TA Protected */
sfr PWM0DTCNT   = 0xFA;     /* TA Protected */
sfr PWM0MEN     = 0xFB;
sfr PWM0MD      = 0xFC;
sfr PORDIS      = 0xFD;
sfr EIP1        = 0xFE;
sfr EIPH1       = 0xFF;

/*---------------------------------------------------------------------------
 * Keil C51 SFR Definitions - Page 1
 *---------------------------------------------------------------------------*/
/* Page 1 SFR Aliases - need page switch for access */
#define P3S         P3M1        /* 0xAC Page 1 */
#define P3SR        P3M2        /* 0xAD Page 1 */
#define P0S         P0M1        /* 0xB1 Page 1 */
#define P0SR        P0M2        /* 0xB2 Page 1 */
#define P1S         P1M1        /* 0xB3 Page 1 */
#define P1SR        P1M2        /* 0xB4 Page 1 */
#define PWM0INTC    IPH         /* 0xB7 Page 1 */
#define PWM0C4H     T3CON       /* 0xC4 Page 1 */
#define PWM0C5H     RL3         /* 0xC5 Page 1 */
#define PIOCON1     RH3         /* 0xC6 Page 1 */
#define PWM0C4L     TL2         /* 0xCC Page 1 */
#define PWM0C5L     TH2         /* 0xCD Page 1 */
#define SPCR2       SPCR        /* 0xF3 Page 1 */
#define LVRDIS      EIPH1       /* 0xFF Page 1 */

/*---------------------------------------------------------------------------
 * Keil C51 SFR Definitions - Page 2 (Extended Features)
 *---------------------------------------------------------------------------*/
/* Note: These are accessed at same addresses when SFRS=2 */
/* ADC Bandgap (0x84-0x86) - Page 2 */
#define ADCBAL_ADDR     0x84
#define ADCBAH_ADDR     0x85
#define ADCCON3_ADDR    0x86

/* Port 2 Mode (0x89-0x8F) - Page 2 */
#define P2M1_ADDR       0x89
#define P2M2_ADDR       0x8A
#define P2SR_ADDR       0x8B
#define P2S_P2_ADDR     0x8C
#define ADCSN_ADDR      0x8D
#define ADCCN_ADDR      0x8E
#define ADCSR_ADDR      0x8F

/* Pull-up Control (0x92-0x97) - Page 2 */
#define P0UP_ADDR       0x92
#define P1UP_ADDR       0x93
#define P2UP_ADDR       0x94
#define P3UP_ADDR       0x95
#define RWKH_ADDR       0x97

/* Additional ADC and Pull-down (0x99-0x9D) - Page 2 */
#define AINDIDS1_ADDR   0x99
#define P0DW_ADDR       0x9A
#define P1DW_ADDR       0x9B
#define P2DW_ADDR       0x9C
#define P3DW_ADDR       0x9D

/* AUXR2-AUXR8 (0xA1-0xA7) - Page 2 */
#define AUXR2_ADDR      0xA1
#define AUXR3_ADDR      0xA2
#define AUXR4_ADDR      0xA3
#define AUXR5_ADDR      0xA4
#define AUXR6_ADDR      0xA5
#define AUXR7_ADDR      0xA6
#define AUXR8_ADDR      0xA7

/* PWM1 Registers (0xA9-0xB7) - Page 2 */
#define PWM1PH_ADDR     0xA9
#define PWM1C0H_ADDR    0xAA
#define PWM1C1H_ADDR    0xAB
#define PWM1MD_ADDR     0xAC
#define PWM1MEN_ADDR    0xAD
#define PWM1PL_ADDR     0xB1
#define PWM1C0L_ADDR    0xB2
#define PWM1C1L_ADDR    0xB3
#define PWM1CON0_ADDR   0xB4
#define PWM1CON1_ADDR   0xB5
#define PWM1INTC_ADDR   0xB6
#define PIOCON2_ADDR    0xB7

/* PWM2 Registers (0xB9-0xC6) - Page 2 */
#define PWM2PH_ADDR     0xB9
#define PWM2C0H_ADDR    0xBA
#define PWM2C1H_ADDR    0xBB
#define PWM2MD_ADDR     0xBC
#define PWM2MEN_ADDR    0xBD
#define PWM2PL_ADDR     0xC1
#define PWM2C0L_ADDR    0xC2
#define PWM2C1L_ADDR    0xC3
#define PWM2CON0_ADDR   0xC4
#define PWM2CON1_ADDR   0xC5
#define PWM2INTC_ADDR   0xC6

/* PWM3 Registers (0xC9-0xD7) - Page 2 */
#define PWM3PH_ADDR     0xC9
#define PWM3C0H_ADDR    0xCA
#define PWM3C1H_ADDR    0xCB
#define PWM3MD_ADDR     0xCC
#define PWM3MEN_ADDR    0xCD
#define EIP2_ADDR       0xCE
#define EIPH2_ADDR      0xCF
#define PWM3PL_ADDR     0xD1
#define PWM3C0L_ADDR    0xD2
#define PWM3C1L_ADDR    0xD3
#define PWM3CON0_ADDR   0xD4
#define PWM3CON1_ADDR   0xD5
#define PWM3INTC_ADDR   0xD6
#define XTLCON_ADDR     0xD7

/* Smart Card Registers (0xD9-0xEF) - Page 2 */
#define SC0DR_ADDR      0xD9
#define SC0EGT_ADDR     0xDA
#define SC0ETURD0_ADDR  0xDB
#define SC0ETURD1_ADDR  0xDC
#define SC0IE_ADDR      0xDD
#define SC0IS_ADDR      0xDE
#define SC0TSR_ADDR     0xDF
#define SC1DR_ADDR      0xE1
#define SC1EGT_ADDR     0xE2
#define SC1ETURD0_ADDR  0xE3
#define SC1ETURD1_ADDR  0xE4
#define SC1IE_ADDR      0xE5
#define SC1IS_ADDR      0xE6
#define SC1TSR_ADDR     0xE7
#define SC2DR_ADDR      0xE9
#define SC2EGT_ADDR     0xEA
#define SC2ETURD0_ADDR  0xEB
#define SC2ETURD1_ADDR  0xEC
#define SC2IE_ADDR      0xED
#define SC2IS_ADDR      0xEE
#define SC2TSR_ADDR     0xEF

