Shoaibashk/MS51_BSP/hal/include/ms51_sfr_32k.h
/* SC Control and PIPS (0xF1-0xFF) - Page 2 */
#define SC0CR0_ADDR     0xF1
#define SC0CR1_ADDR     0xF2
#define SC1CR0_ADDR     0xF3
#define SC1CR1_ADDR     0xF4
#define SC2CR0_ADDR     0xF5
#define SC2CR1_ADDR     0xF6
#define PIPS7_ADDR      0xF7
#define PIPS0_ADDR      0xF9
#define PIPS1_ADDR      0xFA
#define PIPS2_ADDR      0xFB
#define PIPS3_ADDR      0xFC
#define PIPS4_ADDR      0xFD
#define PIPS5_ADDR      0xFE
#define PIPS6_ADDR      0xFF

/* Legacy aliases for backward compatibility */
#define PWMPH       PWM0PH
#define PWM0H       PWM0C0H
#define PWM1H       PWM0C1H
#define PWM2H       PWM0C2H
#define PWM3H       PWM0C3H
#define FBD         PWM0FBD
#define PWMCON0     PWM0CON0
#define PWMPL       PWM0PL
#define PWM0L       PWM0C0L
#define PWM1L       PWM0C1L
#define PWM2L       PWM0C2L
#define PWM3L       PWM0C3L
#define PWMCON1     PWM0CON1
#define PDTEN       PWM0DTEN
#define PDTCNT      PWM0DTCNT
#define PMEN        PWM0MEN
#define PMD         PWM0MD
#define AINDIDS     AINDIDS0
#define RWK         RWKL

#elif defined(COMPILER_IAR)

/*---------------------------------------------------------------------------
 * IAR EW8051 SFR Definitions - Page 0
 *---------------------------------------------------------------------------*/
__sfr __no_init volatile unsigned char P0     @ 0x80;
__sfr __no_init volatile unsigned char SP     @ 0x81;
__sfr __no_init volatile unsigned char DPL    @ 0x82;
__sfr __no_init volatile unsigned char DPH    @ 0x83;
__sfr __no_init volatile unsigned char RCTRIM0 @ 0x84;
__sfr __no_init volatile unsigned char RCTRIM1 @ 0x85;
__sfr __no_init volatile unsigned char RWKL   @ 0x86;
__sfr __no_init volatile unsigned char PCON   @ 0x87;

__sfr __no_init volatile unsigned char TCON   @ 0x88;
__sfr __no_init volatile unsigned char TMOD   @ 0x89;
__sfr __no_init volatile unsigned char TL0    @ 0x8A;
__sfr __no_init volatile unsigned char TL1    @ 0x8B;
__sfr __no_init volatile unsigned char TH0    @ 0x8C;
__sfr __no_init volatile unsigned char TH1    @ 0x8D;
__sfr __no_init volatile unsigned char CKCON  @ 0x8E;
__sfr __no_init volatile unsigned char WKCON  @ 0x8F;

__sfr __no_init volatile unsigned char P1     @ 0x90;
__sfr __no_init volatile unsigned char SFRS   @ 0x91;
__sfr __no_init volatile unsigned char CAPCON0 @ 0x92;
__sfr __no_init volatile unsigned char CAPCON1 @ 0x93;
__sfr __no_init volatile unsigned char CAPCON2 @ 0x94;
__sfr __no_init volatile unsigned char CKDIV  @ 0x95;
__sfr __no_init volatile unsigned char CKSWT  @ 0x96;
__sfr __no_init volatile unsigned char CKEN   @ 0x97;

__sfr __no_init volatile unsigned char SCON   @ 0x98;
__sfr __no_init volatile unsigned char SBUF   @ 0x99;
__sfr __no_init volatile unsigned char SBUF_1 @ 0x9A;
__sfr __no_init volatile unsigned char EIE    @ 0x9B;
__sfr __no_init volatile unsigned char EIE1   @ 0x9C;
__sfr __no_init volatile unsigned char CHPCON @ 0x9F;

__sfr __no_init volatile unsigned char P2     @ 0xA0;
__sfr __no_init volatile unsigned char AUXR1  @ 0xA2;
__sfr __no_init volatile unsigned char BODCON0 @ 0xA3;
__sfr __no_init volatile unsigned char IAPTRG @ 0xA4;
__sfr __no_init volatile unsigned char IAPUEN @ 0xA5;
__sfr __no_init volatile unsigned char IAPAL  @ 0xA6;
__sfr __no_init volatile unsigned char IAPAH  @ 0xA7;

__sfr __no_init volatile unsigned char IE     @ 0xA8;
__sfr __no_init volatile unsigned char SADDR  @ 0xA9;
__sfr __no_init volatile unsigned char WDCON  @ 0xAA;
__sfr __no_init volatile unsigned char BODCON1 @ 0xAB;
__sfr __no_init volatile unsigned char P3M1   @ 0xAC;
__sfr __no_init volatile unsigned char P3M2   @ 0xAD;
__sfr __no_init volatile unsigned char IAPFD  @ 0xAE;
__sfr __no_init volatile unsigned char IAPCN  @ 0xAF;

__sfr __no_init volatile unsigned char P3     @ 0xB0;
__sfr __no_init volatile unsigned char P0M1   @ 0xB1;
__sfr __no_init volatile unsigned char P0M2   @ 0xB2;
__sfr __no_init volatile unsigned char P1M1   @ 0xB3;
__sfr __no_init volatile unsigned char P1M2   @ 0xB4;
__sfr __no_init volatile unsigned char TOE    @ 0xB5;
__sfr __no_init volatile unsigned char IPH    @ 0xB7;

__sfr __no_init volatile unsigned char IP     @ 0xB8;
__sfr __no_init volatile unsigned char SADEN  @ 0xB9;
__sfr __no_init volatile unsigned char SADEN_1 @ 0xBA;
__sfr __no_init volatile unsigned char SADDR_1 @ 0xBB;
__sfr __no_init volatile unsigned char I2DAT  @ 0xBC;
__sfr __no_init volatile unsigned char I2STAT @ 0xBD;
__sfr __no_init volatile unsigned char I2CLK  @ 0xBE;
__sfr __no_init volatile unsigned char I2TOC  @ 0xBF;

__sfr __no_init volatile unsigned char I2CON  @ 0xC0;
__sfr __no_init volatile unsigned char I2ADDR @ 0xC1;
__sfr __no_init volatile unsigned char ADCRL  @ 0xC2;
__sfr __no_init volatile unsigned char ADCRH  @ 0xC3;
__sfr __no_init volatile unsigned char T3CON  @ 0xC4;
__sfr __no_init volatile unsigned char RL3    @ 0xC5;
__sfr __no_init volatile unsigned char RH3    @ 0xC6;
__sfr __no_init volatile unsigned char TA     @ 0xC7;

__sfr __no_init volatile unsigned char T2CON  @ 0xC8;
__sfr __no_init volatile unsigned char T2MOD  @ 0xC9;
__sfr __no_init volatile unsigned char RCMP2L @ 0xCA;
__sfr __no_init volatile unsigned char RCMP2H @ 0xCB;
__sfr __no_init volatile unsigned char TL2    @ 0xCC;
__sfr __no_init volatile unsigned char TH2    @ 0xCD;
__sfr __no_init volatile unsigned char ADCMPL @ 0xCE;
__sfr __no_init volatile unsigned char ADCMPH @ 0xCF;

__sfr __no_init volatile unsigned char PSW    @ 0xD0;
__sfr __no_init volatile unsigned char PWM0PH @ 0xD1;
__sfr __no_init volatile unsigned char PWM0C0H @ 0xD2;
__sfr __no_init volatile unsigned char PWM0C1H @ 0xD3;
__sfr __no_init volatile unsigned char PWM0C2H @ 0xD4;
__sfr __no_init volatile unsigned char PWM0C3H @ 0xD5;
__sfr __no_init volatile unsigned char PNP    @ 0xD6;
__sfr __no_init volatile unsigned char PWM0FBD @ 0xD7;

__sfr __no_init volatile unsigned char PWM0CON0 @ 0xD8;
__sfr __no_init volatile unsigned char PWM0PL @ 0xD9;
__sfr __no_init volatile unsigned char PWM0C0L @ 0xDA;
__sfr __no_init volatile unsigned char PWM0C1L @ 0xDB;
__sfr __no_init volatile unsigned char PWM0C2L @ 0xDC;
__sfr __no_init volatile unsigned char PWM0C3L @ 0xDD;
__sfr __no_init volatile unsigned char PIOCON0 @ 0xDE;
__sfr __no_init volatile unsigned char PWM0CON1 @ 0xDF;

__sfr __no_init volatile unsigned char ACC    @ 0xE0;
__sfr __no_init volatile unsigned char ADCCON1 @ 0xE1;
__sfr __no_init volatile unsigned char ADCCON2 @ 0xE2;
__sfr __no_init volatile unsigned char ADCDLY @ 0xE3;
__sfr __no_init volatile unsigned char C0L    @ 0xE4;
__sfr __no_init volatile unsigned char C0H    @ 0xE5;
__sfr __no_init volatile unsigned char C1L    @ 0xE6;
__sfr __no_init volatile unsigned char C1H    @ 0xE7;

__sfr __no_init volatile unsigned char ADCCON0 @ 0xE8;
__sfr __no_init volatile unsigned char PICON  @ 0xE9;
__sfr __no_init volatile unsigned char PINEN  @ 0xEA;
__sfr __no_init volatile unsigned char PIPEN  @ 0xEB;
__sfr __no_init volatile unsigned char PIF    @ 0xEC;
__sfr __no_init volatile unsigned char C2L    @ 0xED;
__sfr __no_init volatile unsigned char C2H    @ 0xEE;
__sfr __no_init volatile unsigned char EIP    @ 0xEF;

