Shoaibashk/MS51_BSP/hal/include/ms51_sfr_32k.h
__sfr __no_init volatile unsigned char B      @ 0xF0;
__sfr __no_init volatile unsigned char CAPCON3 @ 0xF1;
__sfr __no_init volatile unsigned char CAPCON4 @ 0xF2;
__sfr __no_init volatile unsigned char SPCR   @ 0xF3;
__sfr __no_init volatile unsigned char SPSR   @ 0xF4;
__sfr __no_init volatile unsigned char SPDR   @ 0xF5;
__sfr __no_init volatile unsigned char AINDIDS0 @ 0xF6;
__sfr __no_init volatile unsigned char EIPH   @ 0xF7;

__sfr __no_init volatile unsigned char SCON_1 @ 0xF8;
__sfr __no_init volatile unsigned char PWM0DTEN @ 0xF9;
__sfr __no_init volatile unsigned char PWM0DTCNT @ 0xFA;
__sfr __no_init volatile unsigned char PWM0MEN @ 0xFB;
__sfr __no_init volatile unsigned char PWM0MD @ 0xFC;
__sfr __no_init volatile unsigned char PORDIS @ 0xFD;
__sfr __no_init volatile unsigned char EIP1   @ 0xFE;
__sfr __no_init volatile unsigned char EIPH1  @ 0xFF;

#elif defined(COMPILER_SDCC)

/*---------------------------------------------------------------------------
 * SDCC SFR Definitions - Page 0
 *---------------------------------------------------------------------------*/
__sfr __at(0x80) P0;
__sfr __at(0x81) SP;
__sfr __at(0x82) DPL;
__sfr __at(0x83) DPH;
__sfr __at(0x84) RCTRIM0;
__sfr __at(0x85) RCTRIM1;
__sfr __at(0x86) RWKL;
__sfr __at(0x87) PCON;

__sfr __at(0x88) TCON;
__sfr __at(0x89) TMOD;
__sfr __at(0x8A) TL0;
__sfr __at(0x8B) TL1;
__sfr __at(0x8C) TH0;
__sfr __at(0x8D) TH1;
__sfr __at(0x8E) CKCON;
__sfr __at(0x8F) WKCON;

__sfr __at(0x90) P1;
__sfr __at(0x91) SFRS;
__sfr __at(0x92) CAPCON0;
__sfr __at(0x93) CAPCON1;
__sfr __at(0x94) CAPCON2;
__sfr __at(0x95) CKDIV;
__sfr __at(0x96) CKSWT;
__sfr __at(0x97) CKEN;

__sfr __at(0x98) SCON;
__sfr __at(0x99) SBUF;
__sfr __at(0x9A) SBUF_1;
__sfr __at(0x9B) EIE;
__sfr __at(0x9C) EIE1;
__sfr __at(0x9F) CHPCON;

__sfr __at(0xA0) P2;
__sfr __at(0xA2) AUXR1;
__sfr __at(0xA3) BODCON0;
__sfr __at(0xA4) IAPTRG;
__sfr __at(0xA5) IAPUEN;
__sfr __at(0xA6) IAPAL;
__sfr __at(0xA7) IAPAH;

__sfr __at(0xA8) IE;
__sfr __at(0xA9) SADDR;
__sfr __at(0xAA) WDCON;
__sfr __at(0xAB) BODCON1;
__sfr __at(0xAC) P3M1;
__sfr __at(0xAD) P3M2;
__sfr __at(0xAE) IAPFD;
__sfr __at(0xAF) IAPCN;

__sfr __at(0xB0) P3;
__sfr __at(0xB1) P0M1;
__sfr __at(0xB2) P0M2;
__sfr __at(0xB3) P1M1;
__sfr __at(0xB4) P1M2;
__sfr __at(0xB5) TOE;
__sfr __at(0xB7) IPH;

__sfr __at(0xB8) IP;
__sfr __at(0xB9) SADEN;
__sfr __at(0xBA) SADEN_1;
__sfr __at(0xBB) SADDR_1;
__sfr __at(0xBC) I2DAT;
__sfr __at(0xBD) I2STAT;
__sfr __at(0xBE) I2CLK;
__sfr __at(0xBF) I2TOC;

__sfr __at(0xC0) I2CON;
__sfr __at(0xC1) I2ADDR;
__sfr __at(0xC2) ADCRL;
__sfr __at(0xC3) ADCRH;
__sfr __at(0xC4) T3CON;
__sfr __at(0xC5) RL3;
__sfr __at(0xC6) RH3;
__sfr __at(0xC7) TA;

__sfr __at(0xC8) T2CON;
__sfr __at(0xC9) T2MOD;
__sfr __at(0xCA) RCMP2L;
__sfr __at(0xCB) RCMP2H;
__sfr __at(0xCC) TL2;
__sfr __at(0xCD) TH2;
__sfr __at(0xCE) ADCMPL;
__sfr __at(0xCF) ADCMPH;

__sfr __at(0xD0) PSW;
__sfr __at(0xD1) PWM0PH;
__sfr __at(0xD2) PWM0C0H;
__sfr __at(0xD3) PWM0C1H;
__sfr __at(0xD4) PWM0C2H;
__sfr __at(0xD5) PWM0C3H;
__sfr __at(0xD6) PNP;
__sfr __at(0xD7) PWM0FBD;

__sfr __at(0xD8) PWM0CON0;
__sfr __at(0xD9) PWM0PL;
__sfr __at(0xDA) PWM0C0L;
__sfr __at(0xDB) PWM0C1L;
__sfr __at(0xDC) PWM0C2L;
__sfr __at(0xDD) PWM0C3L;
__sfr __at(0xDE) PIOCON0;
__sfr __at(0xDF) PWM0CON1;

__sfr __at(0xE0) ACC;
__sfr __at(0xE1) ADCCON1;
__sfr __at(0xE2) ADCCON2;
__sfr __at(0xE3) ADCDLY;
__sfr __at(0xE4) C0L;
__sfr __at(0xE5) C0H;
__sfr __at(0xE6) C1L;
__sfr __at(0xE7) C1H;

__sfr __at(0xE8) ADCCON0;
__sfr __at(0xE9) PICON;
__sfr __at(0xEA) PINEN;
__sfr __at(0xEB) PIPEN;
__sfr __at(0xEC) PIF;
__sfr __at(0xED) C2L;
__sfr __at(0xEE) C2H;
__sfr __at(0xEF) EIP;

__sfr __at(0xF0) B;
__sfr __at(0xF1) CAPCON3;
__sfr __at(0xF2) CAPCON4;
__sfr __at(0xF3) SPCR;
__sfr __at(0xF4) SPSR;
__sfr __at(0xF5) SPDR;
__sfr __at(0xF6) AINDIDS0;
__sfr __at(0xF7) EIPH;

__sfr __at(0xF8) SCON_1;
__sfr __at(0xF9) PWM0DTEN;
__sfr __at(0xFA) PWM0DTCNT;
__sfr __at(0xFB) PWM0MEN;
__sfr __at(0xFC) PWM0MD;
__sfr __at(0xFD) PORDIS;
__sfr __at(0xFE) EIP1;
__sfr __at(0xFF) EIPH1;

/* SDCC sbit definitions */
__sbit __at(0x88+7) TF1;
__sbit __at(0x88+6) TR1;
__sbit __at(0x88+5) TF0;
__sbit __at(0x88+4) TR0;
__sbit __at(0x88+3) IE1;
__sbit __at(0x88+2) IT1;
__sbit __at(0x88+1) IE0;
__sbit __at(0x88+0) IT0;

__sbit __at(0xA8+7) EA;
__sbit __at(0xA8+6) EADC;
__sbit __at(0xA8+5) EBOD;
__sbit __at(0xA8+4) ES;
__sbit __at(0xA8+3) ET1;
__sbit __at(0xA8+2) EX1;
__sbit __at(0xA8+1) ET0;
__sbit __at(0xA8+0) EX0;

__sbit __at(0x98+7) SM0;
__sbit __at(0x98+6) SM1;
__sbit __at(0x98+5) SM2;
__sbit __at(0x98+4) REN;
__sbit __at(0x98+3) TB8;
__sbit __at(0x98+2) RB8;
__sbit __at(0x98+1) TI;
__sbit __at(0x98+0) RI;

__sbit __at(0xE8+7) ADCF;
__sbit __at(0xE8+6) ADCS;

__sbit __at(0xD8+7) PWMRUN;
__sbit __at(0xD8+6) LOAD;
__sbit __at(0xD8+5) PWMF;
__sbit __at(0xD8+4) CLRPWM;

__sbit __at(0xC0+6) I2CEN;
__sbit __at(0xC0+5) STA;
__sbit __at(0xC0+4) STO;
__sbit __at(0xC0+3) SI;
__sbit __at(0xC0+2) AA;

__sbit __at(0xC8+7) TF2;
__sbit __at(0xC8+2) TR2;

__sbit __at(0xF8+1) TI_1;
__sbit __at(0xF8+0) RI_1;

/* Legacy aliases */
#define PWMPH       PWM0PH
#define PWM0H       PWM0C0H
#define PWM1H       PWM0C1H
#define PWM2H       PWM0C2H
#define PWM3H       PWM0C3H
#define FBD         PWM0FBD
#define PWMCON0     PWM0CON0
#define PWMPL       PWM0PL
#define PWM0L       PWM0C0L
#define PWM1L       PWM0C1L
#define PWM2L       PWM0C2L
#define PWM3L       PWM0C3L
#define PWMCON1     PWM0CON1
#define PDTEN       PWM0DTEN
#define PDTCNT      PWM0DTCNT
#define PMEN        PWM0MEN
#define PMD         PWM0MD
#define AINDIDS     AINDIDS0
#define RWK         RWKL

#else
    /* Mock SFRs for unit testing - defined in mock files */
#endif

#ifdef __cplusplus
}
#endif

#endif /* MS51_SFR_32K_H */
